writing-literate-elasticsearch-scripts.org
#+TITLE:    Writing literate-programming style Elasticsearch shell scripts with Emacs
#+AUTHOR:   Lee Hinman
#+CATEGORY: blog
#+KEYWORDS: elasticsearch literate programming shell scripts org-mode org-babel
#+STARTUP:  align fold nodlcheck oddeven lognotestate
#+OPTIONS:  H:4 num:nil toc:t \n:nil @:t ::t |:t ^:{} -:t f:t *:t
#+OPTIONS:  skip:nil d:(HIDE) tags:not-in-toc
#+PROPERTY: header-args :results code :exports both :noweb yes
#+HTML_HEAD: <style> body {margin-right:15%; margin-left:15%;} </style>
#+LANGUAGE: en

* Introduction
  In this article I am going to demonstrate how I use Emacs to write
  literate programming-style shell scripts for [[http://elasticsearch.com][Elasticsearch]].  The
  information in this article focuses on writing shell scripts for
  Elasticsearch, but it is easily generalized to writing any language
  in general, and is more of a "here's how I use [[http://orgmode.org][org-mode]] and
  [[http://orgmode.org/worg/org-contrib/babel/][org-babel]] for [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]]" example.

  A large portion of my time goes into writing one-off scripts to test
  things people bring up in IRC, work on examples for the book, or run
  small development tests from the command line (for
  submitting/testing bugs).  Originally I was writing all of these
  scripts by hand, usually copying and pasting the contents that were
  common from an older script to a newer one to be as fast as
  possible.  For a frame of reference, here's a small example script
  that I recently wrote to test whether nested objects are include in
  the _all field of a parent by default:

#+BEGIN_SRC sh :exports code
  #!/usr/bin/env zsh

  curl -XDELETE 'localhost:9200/ntest'
  echo
  curl -XPOST 'localhost:9200/ntest' -d'{
    "mappings": {
      "doc": {
        "properties": {
          "body": {
            "type": "nested",
            "properties": {
              "text": {"type": "string"}
            }
          }
        }
      }
    }
  }'
  echo

  curl -XPOST 'localhost:9200/ntest/doc/1' -d'
  {"body": [{"text": "foo"}, {"text": "eggplant"}]}'
  echo
  curl -XPOST 'localhost:9200/ntest/doc/2' -d'
  {"body": [{"text": "bar"}, {"text": "eggplant"}]}'
  echo
  curl -XPOST 'localhost:9200/ntest/_refresh'
  echo

  curl 'localhost:9200/ntest/_search?pretty' -d'{
    "query": {
      "match": {"_all": "foo"}
    }
  }'

  curl 'localhost:9200/ntest/_search?pretty' -d'{
    "query": {
      "match": {"_all": "bar"}
    }
  }'

  curl 'localhost:9200/ntest/_search?pretty' -d'{
    "query": {
      "match": {"_all": "eggplant"}
    }
  }'
#+END_SRC

* Breaking the pieces apart

  Let's examine the pieces of this script individually:

** The script header

#+BEGIN_SRC sh :exports code
#!/usr/bin/env zsh
#+END_SRC

   For starters, I need to indicate what shell I want to run this on.
   I use zsh for my dotfiles, so I know it exists, I end up using =env=
   to locate it, however, since it's location may vary depending on
   what machine I'm on.  This is constant for every shell script I
   write.

** Creating the index

#+BEGIN_SRC sh :exports both :tangle literate-example.zsh
  curl -XDELETE 'localhost:9200/ntest'
  echo
  curl -XPOST 'localhost:9200/ntest' -d'{
    "mappings": {
      "doc": {
        "properties": {
          "body": {
            "type": "nested",
            "properties": {
              "text": {"type": "string"}
            }
          }
        }
      }
    }
  }'
  echo
#+END_SRC

   Which, when run produces this output (give or take, depending on
   whether the index already exists):

   #+RESULTS:
#+BEGIN_SRC sh
{"error":"IndexMissingException[[ntest] missing]","status":404}
{"ok":true,"acknowledged":true}
#+END_SRC

   The next section of code should look familiar to anyone who's
   probably written a script for Elasticsearch before.  The very first
   thing I do is to delete an index called 'ntest' (to make sure the
   script starts cleanly), then I create an Elasticsearch index called
   'ntest' with the mappings for the particular functionality I want to
   test.  In this case I wanted to test nested objects, so I created an
   ES type called =doc= that has a single nested field called =body=
   containing a string field named =text=.  If you are wondering about
   the extraneous =echo= commands, I insert them because by default
   Elasticsearch does not return a newline in the body of a response,
   and I'd like to cleanly break each curl command into separate lines.

** Indexing documents

#+BEGIN_SRC sh :exports both :tangle literate-example.zsh
  curl -XPOST 'localhost:9200/ntest/doc/1' -d'
  {"body": [{"text": "foo"}, {"text": "eggplant"}]}'
  echo
  curl -XPOST 'localhost:9200/ntest/doc/2' -d'
  {"body": [{"text": "bar"}, {"text": "eggplant"}]}'
  echo
#+END_SRC

   Which outputs:

   #+RESULTS:
#+BEGIN_SRC sh
{"ok":true,"_index":"ntest","_type":"doc","_id":"1","_version":1}
{"ok":true,"_index":"ntest","_type":"doc","_id":"2","_version":1}
#+END_SRC

   After the index is created, the next thing I do (in most cases) is
   to index some example documents.  In this example I'm indexing two
   documents into the newly created 'ntest' index.  Again, I add an
   =echo= command to put each response on a new line.

