writing-literate-elasticsearch-scripts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Writing literate-programming style Elasticsearch shell scripts with Emacs</title>
<!-- 2013-10-29 Tue 20:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lee Hinman" />
<meta  name="keywords" content="elasticsearch literate programming shell scripts org-mode org-babel" />
</head>
<body>
<div id="content">
<h1 class="title">Writing literate-programming style Elasticsearch shell scripts with Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Breaking the pieces apart</a>
<ul>
<li><a href="#sec-2-1">The script header</a></li>
<li><a href="#sec-2-2">Creating the index</a></li>
<li><a href="#sec-2-3">Indexing documents</a></li>
<li><a href="#sec-2-4">Refreshing the index</a></li>
<li><a href="#sec-2-5">Performing queries</a></li>
</ul>
</li>
<li><a href="#sec-3">Wrapping up</a></li>
<li><a href="#sec-4">Addendum</a></li>
<li><a href="#sec-5">Contact</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In this article I am going to demonstrate how I use Emacs to write
literate programming-style shell scripts for <a href="http://elasticsearch.com">Elasticsearch</a>.  The
information in this article focuses on writing shell scripts for
Elasticsearch, but it is easily generalized to writing any language
in general, and is more of a "here's how I use <a href="http://orgmode.org">org-mode</a> and
<a href="http://orgmode.org/worg/org-contrib/babel/">org-babel</a> for <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming</a>" example.
</p>

<p>
A large portion of my time goes into writing one-off scripts to test
things people bring up in IRC, work on examples for the book, or run
small development tests from the command line (for
submitting/testing bugs).  Originally I was writing all of these
scripts by hand, usually copying and pasting the contents that were
common from an older script to a newer one to be as fast as
possible.  For a frame of reference, here's a small example script
that I recently wrote to test whether nested objects are include in
the _all field of a parent by default:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/usr/bin/</span><span style="color: #a020f0;">env</span><span style="color: #b22222;"> zsh</span>

curl -XDELETE <span style="color: #8b2252;">'localhost:9200/ntest'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "mappings": {</span>
<span style="color: #8b2252;">    "doc": {</span>
<span style="color: #8b2252;">      "properties": {</span>
<span style="color: #8b2252;">        "body": {</span>
<span style="color: #8b2252;">          "type": "nested",</span>
<span style="color: #8b2252;">          "properties": {</span>
<span style="color: #8b2252;">            "text": {"type": "string"}</span>
<span style="color: #8b2252;">          }</span>
<span style="color: #8b2252;">        }</span>
<span style="color: #8b2252;">      }</span>
<span style="color: #8b2252;">    }</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
<span style="color: #483d8b;">echo</span>

curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest/doc/1'</span> -d<span style="color: #8b2252;">'</span>
<span style="color: #8b2252;">{"body": [{"text": "foo"}, {"text": "eggplant"}]}'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest/doc/2'</span> -d<span style="color: #8b2252;">'</span>
<span style="color: #8b2252;">{"body": [{"text": "bar"}, {"text": "eggplant"}]}'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest/_refresh'</span>
<span style="color: #483d8b;">echo</span>

curl <span style="color: #8b2252;">'localhost:9200/ntest/_search?pretty'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "query": {</span>
<span style="color: #8b2252;">    "match": {"_all": "foo"}</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>

curl <span style="color: #8b2252;">'localhost:9200/ntest/_search?pretty'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "query": {</span>
<span style="color: #8b2252;">    "match": {"_all": "bar"}</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>

curl <span style="color: #8b2252;">'localhost:9200/ntest/_search?pretty'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "query": {</span>
<span style="color: #8b2252;">    "match": {"_all": "eggplant"}</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Breaking the pieces apart</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's examine the pieces of this script individually:
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">The script header</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/usr/bin/</span><span style="color: #a020f0;">env</span><span style="color: #b22222;"> zsh</span>
</pre>
</div>

<p>
For starters, I need to indicate what shell I want to run this on.
I use zsh for my dotfiles, so I know it exists, I end up using <code>env</code>
to locate it, however, since it's location may vary depending on
what machine I'm on.  This is constant for every shell script I
write.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Creating the index</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">curl -XDELETE <span style="color: #8b2252;">'localhost:9200/ntest'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "mappings": {</span>
<span style="color: #8b2252;">    "doc": {</span>
<span style="color: #8b2252;">      "properties": {</span>
<span style="color: #8b2252;">        "body": {</span>
<span style="color: #8b2252;">          "type": "nested",</span>
<span style="color: #8b2252;">          "properties": {</span>
<span style="color: #8b2252;">            "text": {"type": "string"}</span>
<span style="color: #8b2252;">          }</span>
<span style="color: #8b2252;">        }</span>
<span style="color: #8b2252;">      }</span>
<span style="color: #8b2252;">    }</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
<span style="color: #483d8b;">echo</span>
</pre>
</div>

<p>
Which, when run produces this output (give or take, depending on
whether the index already exists):
</p>

<div class="org-src-container">

<pre class="src src-sh">{<span style="color: #8b2252;">"error"</span>:<span style="color: #8b2252;">"IndexMissingException[[ntest] missing]"</span>,<span style="color: #8b2252;">"status"</span>:404}
{<span style="color: #8b2252;">"ok"</span>:true,<span style="color: #8b2252;">"acknowledged"</span>:true}
</pre>
</div>

<p>
The next section of code should look familiar to anyone who's
probably written a script for Elasticsearch before.  The very first
thing I do is to delete an index called 'ntest' (to make sure the
script starts cleanly), then I create an Elasticsearch index called
'ntest' with the mappings for the particular functionality I want to
test.  In this case I wanted to test nested objects, so I created an
ES type called <code>doc</code> that has a single nested field called <code>body</code>
containing a string field named <code>text</code>.  If you are wondering about
the extraneous <code>echo</code> commands, I insert them because by default
Elasticsearch does not return a newline in the body of a response,
and I'd like to cleanly break each curl command into separate lines.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Indexing documents</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest/doc/1'</span> -d<span style="color: #8b2252;">'</span>
<span style="color: #8b2252;">{"body": [{"text": "foo"}, {"text": "eggplant"}]}'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest/doc/2'</span> -d<span style="color: #8b2252;">'</span>
<span style="color: #8b2252;">{"body": [{"text": "bar"}, {"text": "eggplant"}]}'</span>
<span style="color: #483d8b;">echo</span>
</pre>
</div>

<p>
Which outputs:
</p>

<div class="org-src-container">

<pre class="src src-sh">{<span style="color: #8b2252;">"ok"</span>:true,<span style="color: #8b2252;">"_index"</span>:<span style="color: #8b2252;">"ntest"</span>,<span style="color: #8b2252;">"_type"</span>:<span style="color: #8b2252;">"doc"</span>,<span style="color: #8b2252;">"_id"</span>:<span style="color: #8b2252;">"1"</span>,<span style="color: #8b2252;">"_version"</span>:1}
{<span style="color: #8b2252;">"ok"</span>:true,<span style="color: #8b2252;">"_index"</span>:<span style="color: #8b2252;">"ntest"</span>,<span style="color: #8b2252;">"_type"</span>:<span style="color: #8b2252;">"doc"</span>,<span style="color: #8b2252;">"_id"</span>:<span style="color: #8b2252;">"2"</span>,<span style="color: #8b2252;">"_version"</span>:1}
</pre>
</div>

<p>
After the index is created, the next thing I do (in most cases) is
to index some example documents.  In this example I'm indexing two
documents into the newly created 'ntest' index.  Again, I add an
<code>echo</code> command to put each response on a new line.
</p>
</div>
</div>
