writing-literate-elasticsearch-scripts.org
** Refreshing the index

#+BEGIN_SRC sh :exports both :tangle literate-example.zsh
  curl -XPOST 'localhost:9200/ntest/_refresh'
  echo
#+END_SRC

   Once the documents are indexed, I refresh the index so they will
   show up in searches

