writing-literate-elasticsearch-scripts.html
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Refreshing the index</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest/_refresh'</span>
<span style="color: #483d8b;">echo</span>
</pre>
</div>

<p>
Once the documents are indexed, I refresh the index so they will
show up in searches
</p>
</div>
</div>
