writing-literate-elasticsearch-scripts.html
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Performing queries</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Next, I search to see whether I can find documents containing "foo"
in the <code>_all</code> field.
</p>

<div class="org-src-container">

<pre class="src src-sh">curl <span style="color: #8b2252;">'localhost:9200/ntest/_search?pretty'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "query": {</span>
<span style="color: #8b2252;">    "match": {"_all": "foo"}</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
</pre>
</div>

<p>
And the output:
</p>

<div class="org-src-container">

<pre class="src src-sh">{
  <span style="color: #8b2252;">"took"</span> : 51,
  <span style="color: #8b2252;">"timed_out"</span> : false,
  <span style="color: #8b2252;">"_shards"</span> : {
    <span style="color: #8b2252;">"total"</span> : 5,
    <span style="color: #8b2252;">"successful"</span> : 5,
    <span style="color: #8b2252;">"failed"</span> : 0
  },
  <span style="color: #8b2252;">"hits"</span> : {
    <span style="color: #8b2252;">"total"</span> : 1,
    <span style="color: #8b2252;">"max_score"</span> : 0.8784157,
    <span style="color: #8b2252;">"hits"</span> : [ {
      <span style="color: #8b2252;">"_index"</span> : <span style="color: #8b2252;">"ntest"</span>,
      <span style="color: #8b2252;">"_type"</span> : <span style="color: #8b2252;">"doc"</span>,
      <span style="color: #8b2252;">"_id"</span> : <span style="color: #8b2252;">"1"</span>,
      <span style="color: #8b2252;">"_score"</span> : 0.8784157, <span style="color: #8b2252;">"_source"</span> :
{<span style="color: #8b2252;">"body"</span>: [{<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"foo"</span>}, {<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"eggplant"</span>}]}
    } ]
  }
}
</pre>
</div>

<p>
And a few other queries, just to be sure:
</p>

<div class="org-src-container">

<pre class="src src-sh">curl <span style="color: #8b2252;">'localhost:9200/ntest/_search?pretty'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "query": {</span>
<span style="color: #8b2252;">    "match": {"_all": "bar"}</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>

curl <span style="color: #8b2252;">'localhost:9200/ntest/_search?pretty'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "query": {</span>
<span style="color: #8b2252;">    "match": {"_all": "eggplant"}</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
</pre>
</div>

<p>
With their output:
</p>

<div class="org-src-container">

<pre class="src src-sh">{
  <span style="color: #8b2252;">"took"</span> : 3,
  <span style="color: #8b2252;">"timed_out"</span> : false,
  <span style="color: #8b2252;">"_shards"</span> : {
    <span style="color: #8b2252;">"total"</span> : 5,
    <span style="color: #8b2252;">"successful"</span> : 5,
    <span style="color: #8b2252;">"failed"</span> : 0
  },
  <span style="color: #8b2252;">"hits"</span> : {
    <span style="color: #8b2252;">"total"</span> : 1,
    <span style="color: #8b2252;">"max_score"</span> : 0.8784157,
    <span style="color: #8b2252;">"hits"</span> : [ {
      <span style="color: #8b2252;">"_index"</span> : <span style="color: #8b2252;">"ntest"</span>,
      <span style="color: #8b2252;">"_type"</span> : <span style="color: #8b2252;">"doc"</span>,
      <span style="color: #8b2252;">"_id"</span> : <span style="color: #8b2252;">"2"</span>,
      <span style="color: #8b2252;">"_score"</span> : 0.8784157, <span style="color: #8b2252;">"_source"</span> :
{<span style="color: #8b2252;">"body"</span>: [{<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"bar"</span>}, {<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"eggplant"</span>}]}
    } ]
  }
}
{
  <span style="color: #8b2252;">"took"</span> : 1,
  <span style="color: #8b2252;">"timed_out"</span> : false,
  <span style="color: #8b2252;">"_shards"</span> : {
    <span style="color: #8b2252;">"total"</span> : 5,
    <span style="color: #8b2252;">"successful"</span> : 5,
    <span style="color: #8b2252;">"failed"</span> : 0
  },
  <span style="color: #8b2252;">"hits"</span> : {
    <span style="color: #8b2252;">"total"</span> : 2,
    <span style="color: #8b2252;">"max_score"</span> : 0.8784157,
    <span style="color: #8b2252;">"hits"</span> : [ {
      <span style="color: #8b2252;">"_index"</span> : <span style="color: #8b2252;">"ntest"</span>,
      <span style="color: #8b2252;">"_type"</span> : <span style="color: #8b2252;">"doc"</span>,
      <span style="color: #8b2252;">"_id"</span> : <span style="color: #8b2252;">"2"</span>,
      <span style="color: #8b2252;">"_score"</span> : 0.8784157, <span style="color: #8b2252;">"_source"</span> :
{<span style="color: #8b2252;">"body"</span>: [{<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"bar"</span>}, {<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"eggplant"</span>}]}
    }, {
      <span style="color: #8b2252;">"_index"</span> : <span style="color: #8b2252;">"ntest"</span>,
      <span style="color: #8b2252;">"_type"</span> : <span style="color: #8b2252;">"doc"</span>,
      <span style="color: #8b2252;">"_id"</span> : <span style="color: #8b2252;">"1"</span>,
      <span style="color: #8b2252;">"_score"</span> : 0.8784157, <span style="color: #8b2252;">"_source"</span> :
{<span style="color: #8b2252;">"body"</span>: [{<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"foo"</span>}, {<span style="color: #8b2252;">"text"</span>: <span style="color: #8b2252;">"eggplant"</span>}]}
    } ]
  }
}
</pre>
</div>

<p>
So, why am I going through all this? It's pretty apparent what the
script does, right?
</p>

<p>
The point of this is to demonstrate an actual literate programming
example. So let's break down how I'd do this in a literate style
(hint: this page itself is the output of the literate program).
</p>

<p>
This assumes you're not squeamish about reading about Emacs, and
explaining how to get set up with Emacs, org-mode, and org-babel is
outside the scope of this article.
</p>

<p>
In org-mode, there is a neat feature that allows you to embed
pieces of code that can be edited, run, exported, tangled
individually. So for our script, we write the first part (where the
index is deleted and created) inside of <code>#+BEGIN_SRC</code> and
<code>#+END_SRC</code> blocks. I also write a little description of what I'm
actually doing:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #0000ff; font-weight: bold;">* Testing whether nested documents are included in _all</span>
  The first thing I need to do is delete the old index and create the
  new one:

<span style="color: #b22222;">#+BEGIN_SRC sh</span>
curl -XDELETE <span style="color: #8b2252;">'localhost:9200/ntest'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "mappings": {</span>
<span style="color: #8b2252;">    "doc": {</span>
<span style="color: #8b2252;">      "properties": {</span>
<span style="color: #8b2252;">        "body": {</span>
<span style="color: #8b2252;">          "type": "nested",</span>
<span style="color: #8b2252;">          "properties": {</span>
<span style="color: #8b2252;">            "text": {"type": "string"}</span>
<span style="color: #8b2252;">          }</span>
<span style="color: #8b2252;">        }</span>
<span style="color: #8b2252;">      }</span>
<span style="color: #8b2252;">    }</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
<span style="color: #483d8b;">echo</span>
<span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>

<p>
Now, org-mode has a few neat features here, I can hit =C-c C-'= and
edit the code block in the appropriate major mode (shell-mode in
this case), or I can hit <code>C-c C-c</code> while the cursor is placed
inside the code block to execute just this particular code. When I
hit <code>C-c C-c</code>, the results are added to the buffer in a new
section<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #0000ff; font-weight: bold;">* Testing whether nested documents are included in _all</span>
  The first thing I need to do is delete the old index and create the
  new one:

<span style="color: #b22222;">#+BEGIN_SRC sh</span>
curl -XDELETE <span style="color: #8b2252;">'localhost:9200/ntest'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "mappings": {</span>
<span style="color: #8b2252;">    "doc": {</span>
<span style="color: #8b2252;">      "properties": {</span>
<span style="color: #8b2252;">        "body": {</span>
<span style="color: #8b2252;">          "type": "nested",</span>
<span style="color: #8b2252;">          "properties": {</span>
<span style="color: #8b2252;">            "text": {"type": "string"}</span>
<span style="color: #8b2252;">          }</span>
<span style="color: #8b2252;">        }</span>
<span style="color: #8b2252;">      }</span>
<span style="color: #8b2252;">    }</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
<span style="color: #483d8b;">echo</span>
<span style="color: #b22222;">#+END_SRC</span>

<span style="color: #b22222;">#+RESULTS:</span>
<span style="color: #b22222;">#+BEGIN_SRC sh</span>
{<span style="color: #8b2252;">"error"</span>:<span style="color: #8b2252;">"IndexMissingException[[ntest] missing]"</span>,<span style="color: #8b2252;">"status"</span>:404}
{<span style="color: #8b2252;">"ok"</span>:true,<span style="color: #8b2252;">"acknowledged"</span>:true}
<span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>

<p>
Fantastic! I now have a "section" of a script that I can re-run as
many times as I want. This allows me to access one of the great
benefits of writing like this - being able to selectively re-run
any individual part of a script without having to copy and paste
a part into a separate program or shell!
</p>

<p>
So this is fantastic, I can write documentation into the org-mode
file around my code, leaving myself notes when I (inevitably) forget
what a script does. However, this doesn't really help when I need to
publish the script to a Github issue (for reproducing a bug), or
sending to a customer for something they can run for
themselves. Fortunately org-babel has an ability called "tangling"
which can take chunks of code in a human-readable file like the
example and export them into any number of other files. So let's
make our script tangle-able:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #0000ff; font-weight: bold;">* Testing whether nested documents are included in _all</span>
  The first thing I need to do is delete the old index and create the
  new one:

<span style="color: #b22222;">#+BEGIN_SRC sh :tangle issue-182.sh</span>
curl -XDELETE <span style="color: #8b2252;">'localhost:9200/ntest'</span>
<span style="color: #483d8b;">echo</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/ntest'</span> -d<span style="color: #8b2252;">'{</span>
<span style="color: #8b2252;">  "mappings": {</span>
<span style="color: #8b2252;">    "doc": {</span>
<span style="color: #8b2252;">      "properties": {</span>
<span style="color: #8b2252;">        "body": {</span>
<span style="color: #8b2252;">          "type": "nested",</span>
<span style="color: #8b2252;">          "properties": {</span>
<span style="color: #8b2252;">            "text": {"type": "string"}</span>
<span style="color: #8b2252;">          }</span>
<span style="color: #8b2252;">        }</span>
<span style="color: #8b2252;">      }</span>
<span style="color: #8b2252;">    }</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">}'</span>
<span style="color: #483d8b;">echo</span>
<span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>

<p>
All I did was add the <code>:tangle issue-182.sh</code> line to the source
block, this tells org-babel the name of the file this block should
be tangled to, running <code>org-babel-tangle</code> on the file now generates
this:
</p>

<div class="org-src-container">

<pre class="src src-text">&#8756; cat issue-182.sh
#!/usr/bin/env zsh

curl -XDELETE 'localhost:9200/ntest'
echo
curl -XPOST 'localhost:9200/ntest' -d'{
  "mappings": {
    "doc": {
      "properties": {
        "body": {
          "type": "nested",
          "properties": {
            "text": {"type": "string"}
          }
        }
      }
    }
  }
}'
echo
</pre>
</div>

<p>
Fantastic! Now I can write documentation that is exportable to
something I can give any of my colleagues to run!
</p>

<p>
The last thing I'll show off is reusable pieces of code with the
<code>noweb</code> feature<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>. The <code>noweb</code> feature allows you to reuse
pieces of code in other code blocks by naming a piece, for
example, something that is done frequently in ES scripts is to
refresh, so we can have a block named "refresh" that looks like
this:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #b22222;">#+NAME: refresh</span>
<span style="color: #b22222;">#+BEGIN_SRC sh</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/_refresh'</span>
<span style="color: #483d8b;">echo</span>
<span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>

<p>
Which can be used in other blocks, like this:
</p>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #b22222;">#+BEGIN_SRC sh</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/thing/doc/1'</span> -d<span style="color: #8b2252;">'{"body": "foo"}'</span>
curl -XPOST <span style="color: #8b2252;">'localhost:9200/thing/doc/2'</span> -d<span style="color: #8b2252;">'{"body": "bar"}'</span>
&lt;&lt;refresh&gt;&gt;
<span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>

<p>
Pretty neat! Reusable code!
</p>
</div>
</div>
</div>
