writing-literate-elasticsearch-scripts.org
* Wrapping up

  So now I have the best of both (all?) worlds, I have individual
  blocks of code that can be run independently while I'm testing
  something, Code tangling that can produce a script to give to
  others, and reusable blocks of code for cutting down on boilerplate!
  Plus, I can embed multiple languages into a script, need to write a
  simple function in python for something? Easily done. This has been
  fantastic for writing code examples for [[http://manning.com/hinman/][the book]], as well as
  writing up and testing things for customers. Color me pleased.

  There really isn't a point to this article other than me wanting to
  show some of the neat things I've been using lately, and hopefully
  convince you to take a look at literate programming in general. If
  you aren't afraid of Emacs, check out [[http://orgmode.org/][org-mode]] and [[http://orgmode.org/worg/org-contrib/babel/][org-babel]]!

  One more thing to note, this entirely article was written on
  org-mode, and tangles to produce the ZSH script that I was using in
  a file called =literate-example.zsh=, check out the [[https://raw.github.com/dakrone/dakrone.github.com/master/writing-literate-elasticsearch-scripts.org][raw .org file]]
  and see for yourself!

* Addendum
  - Wait? Aren't you the guy who [[http://writequit.org][owns a domain named after a Vim
    command]]?

  Yes, for the last 3 years I've been using Emacs daily first for my
  work (Clojure), and then later on for the power. I still love Vim
  dearly (especially vim bindings with things like vimperator), but
  since I do so much Clojure and org-mode these days, I don't see
  myself going back to Vim for general programming anytime soon.

* Contact
  Feedback?
  - [[https://twitter.com/thnetos][@thnetos]] on twitter
  - [[https://github.com/dakrone][dakrone]] on github


[fn:1] It's slightly more complex than this because I'm simplifying some
  of the Emacs configuration.

[fn:2] Again, I'm skipping some noweb config in the interest of
  actually being able to finish this article.
