writing-literate-elasticsearch-scripts.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Wrapping up</h2>
<div class="outline-text-2" id="text-3">
<p>
So now I have the best of both (all?) worlds, I have individual
blocks of code that can be run independently while I'm testing
something, Code tangling that can produce a script to give to
others, and reusable blocks of code for cutting down on boilerplate!
Plus, I can embed multiple languages into a script, need to write a
simple function in python for something? Easily done. This has been
fantastic for writing code examples for <a href="http://manning.com/hinman/">the book</a>, as well as
writing up and testing things for customers. Color me pleased.
</p>

<p>
There really isn't a point to this article other than me wanting to
show some of the neat things I've been using lately, and hopefully
convince you to take a look at literate programming in general. If
you aren't afraid of Emacs, check out <a href="http://orgmode.org/">org-mode</a> and <a href="http://orgmode.org/worg/org-contrib/babel/">org-babel</a>!
</p>

<p>
One more thing to note, this entirely article was written on
org-mode, and tangles to produce the ZSH script that I was using in
a file called <code>literate-example.zsh</code>, check out the <a href="http://dakrone.github.io/writing-literate-elasticsearch-scripts.org">raw .org file</a>
and see for yourself!
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Addendum</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Wait? Aren't you the guy who <a href="http://writequit.org">owns a domain named after a Vim
command</a>?
</li>
</ul>

<p>
Yes, for the last 3 years I've been using Emacs daily first for my
work (Clojure), and then later on for the power. I still love Vim
dearly (especially vim bindings with things like vimperator), but
since I do so much Clojure and org-mode these days, I don't see
myself going back to Vim for general programming anytime soon.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Contact</h2>
<div class="outline-text-2" id="text-5">
<p>
Feedback?
</p>
<ul class="org-ul">
<li><a href="https://twitter.com/thnetos">@thnetos</a> on twitter
</li>
<li><a href="https://github.com/dakrone">dakrone</a> on github
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
It's slightly more complex than this because I'm simplifying some
of the Emacs configuration.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Again, I'm skipping some noweb config in the interest of
actually being able to finish this article.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Lee Hinman</p>
<p class="date">Created: 2013-10-29 Tue 20:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.1)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
